app/views/plantasks/_form.html.haml

              .col-lg-8
                = f.select :department_id, Department.all.collect {|x| [x.name, x.id]}, {}, :class => 'select-2 form-control'
      .well.bs-component
---
SELECT "departments".* FROM "departments"   ORDER BY "departments"."name" ASC

              .col-lg-10
                = f.collection_select :egg_timer_id, EggTimer.order(:kind),:id,:kind, class: 'select2 form-control'
      .well.bs-component
---
SELECT "egg_timers".* FROM "egg_timers"   ORDER BY "egg_timers"."kind" ASC