app/views/devise/registrations/_edit.html.haml

SELECT "departments".* FROM "departments"   ORDER BY "departments"."name" ASC
---
                  = f.label :department_id, "Select a department."
                  = f.select :department_id, Department.all.collect {|x| [x.name, x.id]}, {}, class: 'select2 form-control'
              .col-lg-8
                .form-group