app/views/my_task/mytasks.html.haml

                %hr
                - @all = timer.plantasks.associated_user(current_user).uniq.pluck(:equip_number)
---
SELECT DISTINCT "plantasks"."equip_number" FROM "plantasks"  WHERE "plantasks"."associate" = 'aaron_storrer@asamacm.com'

                          - @var = task.to_i
                          = task.to_s + ' | ' + Equipment.find_by_number(@var).name
---
SELECT  "equipment".* FROM "equipment"  WHERE "equipment"."number" = 91019 LIMIT 1