app/controllers/areas_controller.rb

  def create
    @area = Area.new(area_params)

    respond_to do |format|
      if @area.save
---
INSERT INTO "areas" ("created_at", "name", "number", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-12-03 15:24:37.534327"], ["name", "312"], ["number", 2132], ["updated_at", "2014-12-03 15:24:37.534327"]]