app/controllers/dashboard_controller.rb

SELECT  "departments".* FROM "departments"  WHERE "departments"."id" = $1 LIMIT 1  [["id", 3]]
---
    def set_plantask
      @plantasks = Plantask.department(current_user.department_id).all