app/controllers/dashboard_controller.rb

  def dash
    @plantasks         = Plantask.department(current_user.department_id).all
    @total_tasks_count = @plantasks.count
---
SELECT  "departments".* FROM "departments"  WHERE "departments"."id" = $1 LIMIT 1  [["id", 3]]
SELECT COUNT(*) FROM "plantasks"  WHERE "plantasks"."department_id" = 3

  def workloads
    @user = User.department(current_user.department_id).all
---
SELECT "users".* FROM "users"  WHERE "users"."department_id" = 1

  def status
    plantask  = Plantask.department(current_user.department_id).all
    good      = plantask.good.count
---
SELECT COUNT(*) FROM "plantasks"  WHERE "plantasks"."department_id" = 3

  def overdue
    plantasks = Plantask.department(current_user.department_id).all
    overdue   = plantasks.overdue.count
---
SELECT COUNT(*) FROM "plantasks"  WHERE "plantasks"."department_id" = 3 AND "plantasks"."overdue" = 't'