app/controllers/equipment_controller.rb

INSERT INTO "equipment" ("created_at", "name", "number", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-12-03 15:24:52.460175"], ["name", "32421"], ["number", 32314], ["updated_at", "2014-12-03 15:24:52.460175"]]
---
  def create
    @equipment = Equipment.new(equipment_params)

    respond_to do |format|
      if @equipment.save