app/controllers/libraries_controller.rb

SELECT  "areas".* FROM "areas"   ORDER BY number LIMIT 8 OFFSET 0
SELECT COUNT(*) FROM "areas"
SELECT  "equipment".* FROM "equipment"  LIMIT 8 OFFSET 0
SELECT COUNT(*) FROM "equipment"
SELECT  "parts".* FROM "parts"  LIMIT 8 OFFSET 0
SELECT COUNT(*) FROM "parts"
SELECT  "procedures".* FROM "procedures"  LIMIT 8 OFFSET 0
SELECT  "task_methods".* FROM "task_methods"  LIMIT 8 OFFSET 0
SELECT COUNT(*) FROM "procedures"
SELECT COUNT(*) FROM "task_methods"
SELECT  "egg_timers".* FROM "egg_timers"  LIMIT 8 OFFSET 0
SELECT COUNT(*) FROM "egg_timers"
---
  def index
    @area        = Area.order("number").page(params[:page_area]).per(8)
    @equipment   = Equipment.all.page(params[:page_equipment]).per(8)
    @part        = Part.all.page(params[:page_part]).per(8)
    @procedure   = Procedure.all.page(params[:page_method]).per(8)
    @egg_timer   = EggTimer.all.page(params[:page_timer]).per(8)