app/controllers/libraries_controller.rb

SELECT  "areas".* FROM "areas"   ORDER BY number LIMIT 8 OFFSET 0
SELECT COUNT(*) FROM "areas"
SELECT  "equipment".* FROM "equipment"  LIMIT 8 OFFSET 0
SELECT COUNT(*) FROM "equipment"
SELECT  "parts".* FROM "parts"  LIMIT 8 OFFSET 0
SELECT COUNT(*) FROM "parts"
SELECT  "task_methods".* FROM "task_methods"  LIMIT 8 OFFSET 0
SELECT COUNT(*) FROM "task_methods"
---
  def library
    @area        = Area.order("number").page(params[:page_area]).per(8)
    @equipment   = Equipment.all.page(params[:page_equipment]).per(8)
    @part        = Part.all.page(params[:page_part]).per(8)
    @task_method = TaskMethod.all.page(params[:page_method]).per(8)