app/controllers/misc_work_orders_controller.rb

SELECT "misc_work_orders".* FROM "misc_work_orders"
---
  def index
    @misc_work_orders = MiscWorkOrder.all

INSERT INTO "misc_work_orders" ("account_number", "completion_switch", "cost_center", "cost_description", "cost_unit", "created_at", "description", "due_date", "start_date", "updated_at", "urgency") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @misc_work_order = MiscWorkOrder.new(misc_work_order_params)
    @misc_work_order.completion_switch = false

    respond_to do |format|
      if @misc_work_order.save

SELECT "misc_work_orders".* FROM "misc_work_orders"  WHERE "misc_work_orders"."id" IN (1)
---
  def complete
    work_orders = MiscWorkOrder.where(id: params[:misc_work_order_ids])

SELECT  "misc_work_orders".* FROM "misc_work_orders"  WHERE "misc_work_orders"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_misc_work_order
      @misc_work_order = MiscWorkOrder.find(params[:id])