app/controllers/my_task_controller.rb

SELECT "egg_timers".* FROM "egg_timers"
SELECT DISTINCT "plantasks"."equip_number" FROM "plantasks"  WHERE "plantasks"."associate" = 'aaron_storrer@asamacm.com'
---
  def mytasks
    @timers = EggTimer.all
    @plantasks = Plantask.associated_user(current_user).all
  	@tasks                    = @plantasks.order(:equip_number)
    @equipment_groups         = @plantasks.uniq.pluck(:equip_number)