app/controllers/parts_controller.rb

  def create
    @part = Part.new(part_params)

    respond_to do |format|
      if @part.save
---
INSERT INTO "parts" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-11-18 20:54:41.774247"], ["name", "Test"], ["updated_at", "2014-11-18 20:54:41.774247"]]