app/controllers/plantasks_controller.rb

SELECT "plantasks".* FROM "plantasks"  WHERE "plantasks"."department_id" = 3  ORDER BY "plantasks"."equip_number" ASC
---
  def index
    @plantasks = Plantask.department(current_user.department_id).all.order(:equip_number)

SELECT  "plantasks".* FROM "plantasks"  WHERE "plantasks"."id" = $1 LIMIT 1  [["id", 356]]
SELECT "records".* FROM "records"  WHERE "records"."plantask_id" = $1  ORDER BY "records"."created_at" DESC  [["plantask_id", 356]]
SELECT "work_orders".* FROM "work_orders"  WHERE "work_orders"."plantask_id" = $1  ORDER BY "work_orders"."created_at" DESC  [["plantask_id", 356]]
---
  def show
    @plantask = Plantask.find(params[:id])
    @records = @plantask.records.order(created_at: :desc)

SELECT "equipment"."number" FROM "equipment"  WHERE "equipment"."name" = 'Molten Metal Carrier #1'
INSERT INTO "plantasks" ("area", "assigned_switch", "associate", "created_at", "current_status", "data_type", "department_id", "description", "egg_timer_id", "equip_number", "equipment", "est_time", "ext_lower", "ext_upper", "lower", "overdue_count", "part", "procedure", "target", "updated_at", "upper") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21) RETURNING "id"
---
  def create
    @plantask = Plantask.new(plantask_params)
    @plantask.assigned_switch = true
    @plantask.overdue_count = 0

    equip = Equipment.where(name: @plantask.equipment).pluck(:number)
    n = equip.to_s
    @plantask.equip_number = n.delete "[]"

    respond_to do |format|
      if @plantask.save

SELECT "equipment"."number" FROM "equipment"  WHERE "equipment"."name" = 'Molten Metal Carrier #1'
UPDATE "plantasks" SET "department_id" = $1, "est_time" = $2, "updated_at" = $3 WHERE "plantasks"."id" = 356  [["department_id", 1], ["est_time", 1], ["updated_at", "2014-12-04 18:02:54.778704"]]
---
  def update
    equip = Equipment.where(name: @plantask.equipment).pluck(:number)
    n = equip.to_s
    @plantask.equip_number = n.delete "[]"

    respond_to do |format|
      if @plantask.update(plantask_params)

SELECT  "plantasks".* FROM "plantasks"  WHERE "plantasks"."id" = $1 LIMIT 1  [["id", 356]]
---
    def set_plantask
      @plantask = Plantask.find(params[:id])