app/controllers/plantasks_controller.rb

SELECT "equipment"."number" FROM "equipment"  WHERE "equipment"."equipment" = 'Molten Metal Carrier #1'
---
  def update
    equip = Equipment.where(equipment: @plantask.equipment).pluck(:number)