app/controllers/records_controller.rb

  def new
    @plantask = Plantask.find(params[:id])
---
SELECT  "plantasks".* FROM "plantasks"  WHERE "plantasks"."id" = $1 LIMIT 1  [["id", 320]]

  def create
    @plantask = Plantask.find(params[:id])
    @record = @plantask.records.build(record_params)

    respond_to do |format|
      if @record.save
        @plantask.update_plantask_status
---
SELECT  "plantasks".* FROM "plantasks"  WHERE "plantasks"."id" = $1 LIMIT 1  [["id", 10]]
INSERT INTO "records" ("comments", "created_at", "data", "plantask_id", "status", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["comments", "safasdfasdf"], ["created_at", "2014-12-04 17:10:17.950120"], ["data", 23], ["plantask_id", 10], ["status", "GOOD"], ["updated_at", "2014-12-04 17:10:17.950120"]]
UPDATE "plantasks" SET "most_recent_comment" = $1, "updated_at" = $2 WHERE "plantasks"."id" = 10  [["most_recent_comment", "safasdfasdf"], ["updated_at", "2014-12-04 17:10:18.027379"]]