app/controllers/work_orders_controller.rb

SELECT "work_orders".* FROM "work_orders"
---
  def index
    @work_orders = WorkOrder.all

SELECT  "plantasks".* FROM "plantasks"  WHERE "plantasks"."id" = $1 LIMIT 1  [["id", 356]]
---
  def new
    @plantask = Plantask.find(params[:id])

SELECT  "work_orders".* FROM "work_orders"  WHERE "work_orders"."id" = $1 LIMIT 1  [["id", 14]]
---
  def edit
    @work_order = WorkOrder.find(params[:id])

SELECT  "plantasks".* FROM "plantasks"  WHERE "plantasks"."id" = $1 LIMIT 1  [["id", 10]]
INSERT INTO "users_work_orders" ("user_id", "work_order_id") VALUES ($1, $2)  [["user_id", 1], ["work_order_id", 13]]
INSERT INTO "work_orders" ("completion_switch", "created_at", "description", "due_date", "plantask_id", "start_date", "updated_at", "urgency") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @plantask = Plantask.find(params[:id])
    @work_order = @plantask.work_orders.build(work_order_params)
    @work_order.completion_switch = false

    respond_to do |format|
      if @work_order.save

SELECT "work_orders".* FROM "work_orders"  WHERE "work_orders"."id" IN (15)
UPDATE "work_orders" SET "completion_switch" = $1, "updated_at" = $2 WHERE "work_orders"."id" = 15  [["completion_switch", "f"], ["updated_at", "2014-12-04 14:30:08.632359"]]
---
  def complete
    WorkOrder.where(id: params[:work_order_ids]).update_all(completion_switch: true)

SELECT  "work_orders".* FROM "work_orders"  WHERE "work_orders"."id" = $1 LIMIT 1  [["id", 7]]
---
    def set_work_order
      @work_order = WorkOrder.find(params[:id])