app/views/work_orders/_edit_form.html.haml

SELECT "users".* FROM "users"
---
            .col-lg-12
              = f.select :user_ids, User.all.collect {|x| [x.name, x.id]}, {}, :multiple => true, :class => 'select-2 form-control'
        .row
          .col-lg-12
            .text-center{:style => "margin-top: 10px; margin-bottom: 20px;"}