app/views/work_orders/_form.html.haml

            .col-lg-10
              = f.select :department_id, Department.all.collect {|x| [x.name, x.id]}, {}, :class => 'select-2 form-control'
        .form-group
          .row
            .col-lg-2
---
SELECT "departments".* FROM "departments"

            .col-lg-12
              = f.select :user_ids, User.all.collect {|x| [x.name, x.id]}, {}, :multiple => true, :class => 'select-2 form-control'
        .row
          .col-lg-12
            .text-center{:style => "margin-top: 10px; margin-bottom: 20px;"}
---
SELECT "users".* FROM "users"